In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

In [3]:
df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [4]:
new_products = pd.DataFrame(
    [{'product_id':24, 'name':'phone',
     'wholesale_price': 200, 'retail_price':500},
     {'product_id':16, 'name':'apple', 'wholesale_price': 0.5,
     'retail_price':1},
     {'product_id':17, 'name':'pear', 'wholesale_price': 0.6,
     'retail_price':1.2}
     ], index=range(5,8))
new_products

   product_id   name  wholesale_price  retail_price
5          24  phone            200.0         500.0
6          16  apple              0.5           1.0
7          17   pear              0.6           1.2

In [5]:
df = pd.concat([df, new_products])
df

   product_id            name  wholesale_price  retail_price   sales
0          23        computer            500.0        1000.0   100.0
1          96  Python Workout             35.0          75.0  1000.0
2          97  Pandas Workout             35.0          75.0   500.0
3          15          banana              0.5           1.0   200.0
4          87        sandwich              3.0           5.0   300.0
5          24           phone            200.0         500.0     NaN
6          16           apple              0.5           1.0     NaN
7          17            pear              0.6           1.2     NaN

In [6]:
df.loc[[5, 6, 7], 'sales']

5   NaN
6   NaN
7   NaN
Name: sales, dtype: float64

In [7]:
df.loc[[5,6,7], 'sales'] = [100, 200, 75]
df

   product_id            name  wholesale_price  retail_price   sales
0          23        computer            500.0        1000.0   100.0
1          96  Python Workout             35.0          75.0  1000.0
2          97  Pandas Workout             35.0          75.0   500.0
3          15          banana              0.5           1.0   200.0
4          87        sandwich              3.0           5.0   300.0
5          24           phone            200.0         500.0   100.0
6          16           apple              0.5           1.0   200.0
7          17            pear              0.6           1.2    75.0

In [8]:
((df['retail_price'] - df['wholesale_price']) * df['sales']).sum()

np.float64(140845.0)

### Beyond the exercise

Add one new product to the data frame without using pd.concat. Whatâ€™s the advantage of pd.concat, and when should you use it?

In [9]:
df.loc[8] = [20, 'grapes', 1, 2, 80]

In [10]:
df

   product_id            name  wholesale_price  retail_price   sales
0          23        computer            500.0        1000.0   100.0
1          96  Python Workout             35.0          75.0  1000.0
2          97  Pandas Workout             35.0          75.0   500.0
3          15          banana              0.5           1.0   200.0
4          87        sandwich              3.0           5.0   300.0
5          24           phone            200.0         500.0   100.0
6          16           apple              0.5           1.0   200.0
7          17            pear              0.6           1.2    75.0
8          20          grapes              1.0           2.0    80.0

Add a new column, department, to the data frame. Place each product in a department. For example, in our data, we would have three departments: electronics, books, and food. Calculate current_net on the data frame, and then show descriptive statistics for the current_net on food products.

In [15]:
df['department'] = ['electronics', 'books', 'books', 'food', 'food', 'electronics', 'food', 'food', 'food']

In [16]:
df

,product_id,name,wholesale_price,retail_price,sales,department
0,23,computer,500.0,1000.0,100.0,electronics
1,96,Python Workout,35.0,75.0,1000.0,books
2,97,Pandas Workout,35.0,75.0,500.0,books
3,15,banana,0.5,1.0,200.0,food
4,87,sandwich,3.0,5.0,300.0,food
5,24,phone,200.0,500.0,100.0,electronics
6,16,apple,0.5,1.0,200.0,food
7,17,pear,0.6,1.2,75.0,food
8,20,grapes,1.0,2.0,80.0,food

In [17]:
df.loc[df['department']== 'food']['sales']

3    200.0
4    300.0
6    200.0
7     75.0
8     80.0
Name: sales, dtype: float64

In [18]:
df.loc[df['department']== 'food']['sales'].describe()

count      5.000000
mean     171.000000
std       94.630862
min       75.000000
25%       80.000000
50%      200.000000
75%      200.000000
max      300.000000
Name: sales, dtype: float64